In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("titanic.csv")

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [9]:
df.groupby("Sex")["Age"].max()

Sex
female    63.0
male      80.0
Name: Age, dtype: float64

In [15]:
df.groupby(["Sex","Embarked","Survived"])["Fare"].mean()

Sex     Embarked  Survived
female  C         0           16.215278
                  1           83.460286
        Q         0           10.904633
                  1           13.211733
        S         0           25.728508
                  1           44.596518
male    C         0           38.065342
                  1           71.468545
        Q         0           13.911732
                  1           12.916667
        S         0           19.881281
                  1           30.366286
Name: Fare, dtype: float64

In [16]:
res = df.groupby(["Sex","Embarked","Survived"])["Fare"].mean()

In [17]:
type(res)

pandas.core.series.Series

In [18]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [19]:
df.groupby("Sex")["Age"].max().reset_index()

      Sex   Age
0  female  63.0
1    male  80.0

In [20]:
op = {'Fare': ['max','min']}

In [23]:
df.groupby("Pclass").agg(op)

            Fare
             max  min
Pclass
1       512.3292  0.0
2        73.5000  0.0
3        69.5500  0.0

In [29]:
resultado_columns = df.groupby("Pclass").agg(op)

In [32]:
## Limpieza de Datos


%matplotlib inline

estudiantes = pd.DataFrame({"nombre":['Sergio', 'Andres','Andrea','Irene','Nuria'],
                            "grado":[1,1,1,1,1],
                            "edad":[18,19,None,19,None]
                           })

In [34]:
estudiantes

   nombre  grado  edad
0  Sergio      1  18.0
1  Andres      1  19.0
2  Andrea      1   NaN
3   Irene      1  19.0
4   Nuria      1   NaN